SET CONSTRAINTS ALL DEFERRED;
DELETE FROM users;
DELETE FROM subjects;
DELETE FROM student_groups;
DELETE FROM timetables;
DELETE FROM teachers;
DELETE FROM teacher_subject;
DELETE FROM students;
DELETE FROM progress;

INSERT INTO subjects (name) VALUES
  ('Политология'),
  ('Социология'),
  ('Филоссофия'),
  ('Логика'),
  ('Экономика'),
  ('Экология'),
  ('Физика'),
  ('Математика'),
  ('Химия'),
  ('История'),
  ('Информатика'),
  ('Охрана труда'),
  ('Инженерная графика');


INSERT INTO student_groups (name) VALUES
  ('553501'),
  ('551001'),
  ('550701'),
  ('550531'),
  ('550501'),
  ('453501'),
  ('451001'),
  ('450701'),
  ('450531'),
  ('450501'),
  ('353501'),
  ('351001'),
  ('350701');


INSERT INTO students (name, photo, email, skype, descr, phone, group_id) VALUES
  ('Абрамович Максим  Викторович', 'photo.png', 'bendikov@cemi.rssi.ru', 'abram',
   'Учился я... А НАДО БЫЛО ДУМАТЬ...', '801775-36159', 14),
  ('Алешко Валерий  Игореввич', 'photo.png', 'zacharovaa@mail.ru', 'aleshko',
   'Коротко о себе: Год выпуска 1988. Пробег 26. Цвет лёгкого загара. Фары зеленые. Документы на руках. Кузов не битый. Крыша на месте. Тормоза в норме. Все опции. Завожусь с полуоборота…',
   ' 8-1775-7-95-03', 14),
  ('Брычиков Даниил  Дмитриевич', 'photo.png', 'brich@mail.ru', 'brich',
   'Мне всё по зубам… иногда, правда, и по шее достаётся…', '+375 29 658-41-82', 14),
  ('Вистяж Алексей  Владимирович', 'photo.png', 'vist@tut.by', 'vist', 'Я никогда не вру, но я … я недоговариваю.',
   '+375-17-217–04–24', 14),
  ('Глубокий Станислав  Сергеевич', 'photo.png', 'glub@tut.by', 'glub',
   'Я отвлекаюсь от повседневной суеты. Ломаю стереотипы, разрушаю рамки, перехожу черты, перегибаю палки... В целом, расширяю горизонты.',
   '+375 29 1014933', 14);


INSERT INTO progress (score, subject_id, student_id, date) VALUES
  (2, 14, 6, '2016-02-29 20:15:00'),
  (10, 14, 6, '2016-03-07 21:10:00'),
  (10, 14, 6, '2016-03-07 21:10:00'),
  (10, 14, 6, '2016-03-07 21:10:00'),
  (10, 14, 6, '2016-02-29 21:10:00'),
  (10, 14, 6, '2016-03-01 21:10:00'),
  (1, 14, 7, '2016-03-02 21:10:00'),
  (3, 14, 7, '2016-03-03 21:10:00'),
  (4, 14, 7, '2016-03-04 21:10:00'),
  (2, 14, 7, '2016-03-05 21:10:00'),
  (4, 14, 7, '2016-03-06 21:10:00'),
  (1, 14, 7, '2016-03-07 21:10:00'),
  (2, 14, 8, '2016-03-08 21:10:00'),
  (4, 14, 8, '2016-03-09 21:10:00'),
  (1, 14, 8, '2016-03-10 21:10:00'),
  (1, 14, 8, '2016-03-11 21:10:00'),
  (1, 14, 8, '2016-03-12 21:10:00'),
  (1, 14, 8, '2016-03-13 21:10:00');


INSERT INTO teachers (name, photo, email, phone, skype, descr) VALUES
  ('БОБКОВ Владимир Андреевич', 'photo.png', 'bob@mail.ru', '+375(017) 367-05-29', 'bob',
   'зав. каф., профессор, доктор исторических наук, член-корреспондент НАН Беларуси, заслуженный деятель науки Республики Беларусь'),
  ('БЕЛЯЕВ Алексей Викторович', 'photo.png', 'bel@tut.by', '+375(017) 368-87-69', 'bel', 'доцент; к.и.н.'),
  ('ДУБОВИК Александр Константинович', 'photo.png', 'dub@gmail.com', '(+375 17) 292-31-72 ', 'dub',
   'доцент; к.и.н.'),
  ('Лойко Александр Иванович', 'photo.png', 'loiko@rambler.ru', ' (+375 17) 293-96-23', 'loiko',
   'Заведующий кафедрой, д.ф.н., профессор');

INSERT INTO timetables (start_time, end_time, group_id, subject_id) VALUES
  ('2016-03-06 18:00:00', '2016-03-06 19:35:00', 1, 1),
  ('2016-03-06 19:55:00', '2016-03-06 21:30:00', 1, 2),
  ('2016-03-06 21:40:00', '2016-03-06 23:15:00', 1, 3),
  ('2016-03-06 23:25:00', '2016-03-07 01:00:00', 1, 4),
  ('2016-03-07 18:00:00', '2016-03-07 19:35:00', 1, 5),
  ('2016-03-08 05:42:38', '2016-03-07 21:30:00', 1, 3),
  ('2016-03-07 21:40:00', '2016-03-07 23:15:00', 1, 2),
  ('2016-03-07 23:25:00', '2016-03-08 01:00:00', 1, 6),
  ('2016-03-08 19:55:00', '2016-03-08 21:30:00', 1, 7),
  ('2016-03-08 21:40:00', '2016-03-08 23:15:00', 1, 8),
  ('2016-03-08 23:25:00', '2016-03-09 01:00:00', 1, 9),
  ('2016-03-09 18:00:00', '2016-03-09 19:35:00', 1, 7),
  ('2016-03-09 19:55:00', '2016-03-09 21:30:00', 1, 1),
  ('2016-03-09 21:40:00', '2016-03-09 23:15:00', 1, 11),
  ('2016-03-09 23:25:00', '2016-03-10 01:00:00', 1, 3),
  ('2016-03-10 21:40:00', '2016-03-10 23:15:00', 1, 5),
  ('2016-03-10 23:15:00', '2016-03-11 01:00:00', 1, 2),
  ('2016-03-11 18:00:00', '2016-03-11 19:35:00', 1, 12),
  ('2016-03-07 19:55:00', '2016-03-07 21:30:00', 1, 13);

INSERT INTO users (email, password, role) VALUES
  ('admin@admin.ru', '$2a$10$2Uq9QjwEskZUFaOY1h0q5u3OubNCuLBowKMqH1L3iXRL9R5qSjUxC', 'ROLE_ADMIN'),
  ('user@user.by', '$2a$10$60Zjv6nRNxcAkW/s1.OaVuu4mOClXDw8TTkDirL7acGa0841PvHiG', 'ROLE_USER');
